lab-notes/OpenFoam/Example/passiveScalarCavity/case/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue s 0
);

regions
(
    // Setting values inside a box
    boxToCell
    {
        box     (0.03 0.03 -1) (0.06 0.06 1);
        fieldValues
        (
            volScalarFieldValue s 1
        );
    }
);


// ************************************************************************* //
